IDENTIFICATION DIVISION.
PROGRAM-ID. MAIN.
ENVIRONMENT DIVISION.
PROCEDURE DIVISION.
    CALL 'fun_a' END-CALL.

    IDENTIFICATION DIVISION.
    PROGRAM-ID. fun_b IS COMMON.
    ENVIRONMENT DIVISION.
    PROCEDURE DIVISION.
    END PROGRAM fun_b.

    IDENTIFICATION DIVISION.
    PROGRAM-ID. fun_a IS COMMON.
    ENVIRONMENT DIVISION.
    PROCEDURE DIVISION.
        CALL 'fun_b' END-CALL.
        DISPLAY 'C' WITH NO ADVANCING END-DISPLAY.
    END PROGRAM fun_a.
END PROGRAM MAIN.
