IDENTIFICATION DIVISION.
PROGRAM-ID. MAIN.
ENVIRONMENT DIVISION.
PROCEDURE DIVISION.
    CALL 'P_1' END-CALL.

    IDENTIFICATION DIVISION.
    PROGRAM-ID. P_0 IS COMMON.
    ENVIRONMENT DIVISION.
    PROCEDURE DIVISION.
    END PROGRAM P_0.

    IDENTIFICATION DIVISION.
    PROGRAM-ID. P_1 IS COMMON.
    ENVIRONMENT DIVISION.
    PROCEDURE DIVISION.
        CALL 'P_0' END-CALL.
        DISPLAY 'C' WITH NO ADVANCING END-DISPLAY.
    END PROGRAM P_1.
END PROGRAM MAIN.
