IDENTIFICATION DIVISION.
PROGRAM-ID. MAIN.
ENVIRONMENT DIVISION.
PROCEDURE DIVISION.
    DISPLAY 'X' WITH NO ADVANCING END-DISPLAY.
END PROGRAM MAIN.
